{
  "lang": "de",
  "langVis": "DE",
  "main": {
    "subText": "Browser Games und Coding Projekte",
    "line1": "Inforge bietet dabei Projekte in Form von Browser Games und Open Source Coding Projekte.",
    "line2": "Inforge bietet auch eine Platform für den Austausch von Ideen, Vorschlägen und Bug Reports von Projekten.",
    "line3": "Es ist für uns wichtig, Software und Webanwendung nach Communitywünschen zu entwickeln.",
    "line4": "Probiert gerne die Spiele aus und gibt uns Ideen und Verbesserungsvorschläge zu den Projekten.",
    "diceBluffHeadline": "DiceBluff",
    "diceBluffLine1": "DiceBluff ist eine Browser Game Adaption von dem Würfelspiel namens \"Mäxchen\" oder \"Mia\".",
    "diceBluffLine2": "DiceBluff ist ein geselliges Würfelspiel, bei dem Spieler abwechselnd würfeln und versuchen, beim Lügen nicht erwischt zu werden. Spieler geben ihre Würfelergebnisse an und der nächste Spieler muss entscheiden, ob er ihnen glaubt oder nicht. Ziel ist es, als Letzter übrig zu bleiben. Es ist ein einfaches, aber unterhaltsames Spiel, das für jede Art von Zusammenkunft geeignet ist und für viel Spaß und Lachen sorgt.",
    "diceBluffButton": "Zu DiceBluff",
    "frameGameHeadline": "FrameGame",
    "frameGameLine1": "FrameGame ist eine modifizierte Variante von \"Gartic Phone\". Anstatt Dinge zu zeichnen oder malen, kann man bei FrameGame sein Bild mit vielen verschiedenen Bilddateien zusammenstellen. Dabei stehen einem eine große Bibliothek an Bilder zur verfügung.",
    "frameGameButton": "Zu FrameGame",
    "projectsHeadline": "Weitere Projekte",
    "projectsSub": "Hier sind weitere Projekte die in Arbeit sind. Die meisten sind erst am Anfang in der Entwicklung und noch sehr unausgereift.",
    "projectsAUL": "AmongUsLive",
    "projectsAULText": "AmongUsLive ist eine AmongUs Version die man im echten Leben spielen kann. Dieses Browsergame versucht das Spielerlebnis und die Spannung um echten Leben zu simulieren. Dabei ist dein Smartphone dein Wegbegleiter. Dieses Projekt liegt vorerst auf Eis, weil es in der Entwicklung zu komplikationen kam und andere Projekte vorrang hatten.",
    "projectsDC": "DiscordBot",
    "projectsDCText": "DiscordBot ist ein selbstprogrammierter Discord Bot. Dieses Projekt steht noch in den Startlöchern und wartet darauf mit Features der Community gefüllt zu werden.",
    "projectsRW": "RaspiWindow",
    "projectsRWText": "RaspiWindow ist ein Smart Window. Es zeigt dir verschidene Informationen zu verschiedene Dinge an. Das Projekt ist eine Weseite, die damals von meinem Raspberry Pi 3b+ angezeigt wurde. Das Projekt ist bis jetzt nur für meine private Anwendung konzipiert. Es folgt noch eine communitytaugliche Version.",
    "projectsIC": "Intercra",
    "projectsICText": "Intercra ist eine benutzerdefinierte Suchmaschine, die Suchergebnisse anhand von Voreingestellten Webseiten anzeigen kann. Dieses Projekt ist im Ramen meiner Abiturprüfung entstanden.",
    "ideasHeadline": "Ideen für weitere Projekte",
    "ideasSub": "Hier sieht man Ideen zu Projekten die ich umsetzen möchte",
    "ideasProject1Headline": "Mensch ärgere dich nicht mit Powerups",
    "ideasProject1Text": "Mensch ärgere dich nicht spannender gestalten durch Verwendung von Powerups die das Spielerlebnis erweitern und spannender machen.",
    "ideasProject2Headline": "BattleFlag",
    "ideasProject2Text": "Eine Adaption vom alten ICQ spiel namens 'RPS'. Ein gGemisch aus Schere Stein Papier und Schach.",
    "ideasProject3Headline": "OpenBG",
    "ideasProject3Text": "Eine Sammelstelle von Browsergames-Lobbys. Eine Platform wo die private Lobby eines Browsergames gelistet ist damit auch fremde Spieler die Lobby beitreten können.",
    "ideasProject4Headline": "LEDSteuerung",
    "ideasProject4Text": "Eine LED-Steuerungssoftware mit der man LEDs steuern kann. Spezialisiert auf ansteuerbare LEDs wie zb WS2812 LEDs.",
    "statsStatus": "Serverstatus",
    "statsDBHeadline": "DiceBluff",
    "statsDBSessionOnline": "Sitzungen Online",
    "statsDBPlayersOnline": "Spieler Online",
    "statsDBSessionTotal": "Sitzungen insgesamt",
    "statsDBWinner": "Sieger insgesamt",
    "statsDBLooser": "Verlierer insgesamt",
    "statsFGHeadline": "FrameGame",
    "statsFGSessionOnline": "Sitzungen Online",
    "statsFGPlayersOnline": "Spieler Online",
    "statsFGSessionTotal": "Sitzungen insgesamt",
    "statsFGImage": "Bilder kreiert"
  },
  "games": {
    "dbHeadline": "DiceBluff",
    "dbLine1": "DiceBluff ist eine Browser-Game-Adaption des Würfelspiels namens \"Mäxchen\" oder \"Mia\". Ziel ist es, nicht beim Lügen erwischt zu werden und auch etwas Glück zu haben.",
    "dbLine2": "Aber wie funktioniert das Spiel? Ich erkläre es mal ganz grob. Unter einem Würfelbecher befinden sich 2 Würfel. Diese ergeben eine Zahl. Die Zahl setzt sich so zusammen, dass die größere Zahl der Würfel die Zehnerstelle ist und die kleinere Zahl die Einerstelle. Also ergibt beispielsweise \"2\" und \"5\" die Zahl 52 und \"6\" und \"1\" die Zahl 61. Wenn wir nun alle Pasche weglassen, haben wir folgende Zahlen: 31-32, 41-43, 51-54, 61, 65. Die nächsthöhere Zahl nach der \"65\" wäre der 1er-Pasch (\"11\"). Danach folgt der 2er-Pasch (\"22\") usw. bis zum 6er-Pasch (\"66\"). Die allerhöchste Zahl ist die \"21\".",
    "dbLine3": "Nachdem ich gewürfelt habe, sehe nur ich die Würfel. Nehmen wir an, ich habe eine 43 gewürfelt. Nun schiebe ich den Würfelbecher zum nächsten Spieler und behaupte, dass ich eine \"43\" habe. Jetzt kann der nächste Spieler entscheiden, ob ich gelogen habe oder nicht. Nehmen wir an, er glaubt mir. Jetzt muss er würfeln und er würfelt einen 2er-Pasch. Anschließend schiebt er den Becher zum nächsten Spieler und behauptet, dass er einen 2er-Pasch hat. Der nächste Spieler glaubt ihm und würfelt ebenfalls. Er erhält eine 63. Jetzt muss er lügen, da er immer eine höhere Zahl als die zuvor genannte sagen muss. Also gibt er an, dass er einen 4er-Pasch hat. Der nächste Spieler glaubt ihm nicht, deckt den Würfelbecher auf und hat ihn beim Lügen erwischt. Nun verliert er ein Leben. Dieses Spielprinzip setzt sich fort, bis ein Spieler gewonnen hat.",
    "dbButton": "Zu DiceBluff",
    "dbButtonFullIntro": "Vollständige Spielanleitung",
    "fgHeadline": "FrameGame",
    "fgLine1": "FrameGame ist eine modifizierte Variante des Browsergames \"Gartic Phone\". Das Ziel ist es, eine lustige und unterhaltsame Kette aus Bildern zu erstellen.",
    "fgLine2": "Aber wie funktioniert das Spiel? Das Spiel ist in Runden aufgeteilt, wobei es so viele Runden gibt, wie es Spieler gibt. In der ersten Runde denkt sich jeder eine lustige oder unterhaltsame Situation aus, zum Beispiel \"Ein Elefant auf dem Mond, der einen Hut trägt\". In der nächsten Runde erhält dann jemand den Satz von einem anderen Spieler und muss ihn nachbauen. Als Mittel stehen Textfelder und Bilder aus dem Internet zur Verfügung. FrameGame enthält eine integrierte Bildersuche, die Bilder aus dem Internet anbietet. So kann man nun in der Bildersuche nach einem Mond, einem Elefanten und einem Hut suchen und sie in seine Leinwand einbauen.",
    "fgLine3": "Sobald jeder damit fertig ist, geht es in die nächste Runde, in der die erstellten Bilder der anderen erraten werden müssen, was sie darstellen sollen. Zum Beispiel könnte jemand denken, dass ein Bild einen Elefanten auf einem Planeten zeigt, der eine Kappe trägt und umherschwebt. In der nächsten Runde muss nun jemand anderes diese neue Beschreibung zum Bild nachbauen.",
    "fgLine4": "So kommt es oft zu Missverständnissen und es entsteht eine unterhaltsame Kette von Bildern, ähnlich wie bei \"Stille Post\".",
    "fgLine5": "Dieses Projekt befindet sich noch in der Entwicklung und wird in naher Zukuft veröffentlicht.",
    "fgButton": "Zu FrameGame",
    "fgButtonFullIntro": "Vollständige Spielanleitung",
    "aulHeadline": "AmongUsLive",
    "aulLine1": "AmongUsLive ist eine Variante von AmongUs, die im echten Leben gespielt werden kann.",
    "aulLine2": "Das Spiel funktioniert so, dass in den Gebäuden, in denen AmongUsLive gespielt wird, QR-Codes angebracht werden müssen, die gescannt werden können, um die auf dem Handy angezeigten Aufgaben zu lösen. Jeder Spieler erhält auf seinem Handy die Aufgaben, die er erledigen muss. Auf diese Weise weiß er, welche QR-Codes er scannen muss. Es ist auch möglich, eine Karte des Spielfelds hochzuladen, damit jeder Spieler weiß, wo sich seine Aufgaben befinden.",
    "aulLine3": "Der Imposter kann Spieler eliminieren, indem er beispielsweise einen Spieler antippt. Die genaue Umsetzung bleibt der Spielergruppe überlassen, über die sie sich einigen müssen.",
    "aulLine4": "Sabotagen werden so umgesetzt, dass der Imposter über sein Handy eine Sabotage starten kann und die Spieler spezielle QR-Codes scannen müssen, um die Sabotage zu beheben.",
    "aulLine5": "Meetings werden so organisiert, dass, wenn ein Spieler ein Meeting einberuft, alle Spieler eine Benachrichtigung auf ihrem Handy erhalten, dass ein Meeting stattfindet, und dass sie sich an einem festgelegten Ort treffen müssen. Sobald sich alle Spieler getroffen haben, kann der Spieler, der das Meeting einberufen hat, das Meeting starten, sobald er feststellt, dass sich alle Spieler am festgelegten Treffpunkt befinden. Bei Meetings stimmen die Spieler auf ihren Handys ab und sehen dann das Ergebnis, nachdem alle Spieler abgestimmt haben.",
    "aulLine6": "Es gibt auch eine Zusatzfunktion, bei der eine Oberfläche dauerhaft auf einem Fernseher oder einer Leinwand angezeigt werden kann. Diese dient dazu, den Fortschritt bei den gelösten Aufgaben zu verfolgen oder in Echtzeit zu sehen, wo gerade eine Aufgabe gelöst wird. Außerdem können Meetings darüber organisiert werden, sodass das Votingergebnis auf der Leinwand oder dem Fernseher angezeigt werden kann.",
    "aulLine7": "Dieses Projekt befindet sich noch in der Entwicklung und wird in naher Zukunft noch nicht veröffentlicht."

  },
  "projects": {
    "dicordBotLine1": "Stop Game"
  },
  "ui": {
    "moreInformationButton": "Weitere Informationen",
    "moreInfosButton": "Weitere Infos"
  }
}