{
  "lang": "en",
  "langVis": "EN",
  "main": {
    "subText": "Browser games and coding projects",
    "line1": "Inforge offers projects in the form of browser games and open-source coding projects.",
    "line2": "Inforge also provides a platform for sharing ideas, suggestions, and bug reports for projects.",
    "line3": "It is important for us to develop software and web applications according to the community's wishes.",
    "line4": "Feel free to try out the games and give us ideas and suggestions for improving the projects.",
    "diceBluffHeadline": "DiceBluff",
    "diceBluffLine1": "DiceBluff is a browser game adaptation of the dice game called \"Mäxchen\" or \"Mia\".",
    "diceBluffLine2": "DiceBluff is a social dice game where players take turns rolling dice and trying not to get caught lying. Players announce their dice results, and the next player must decide whether to believe them or not. The goal is to be the last one standing. It’s a simple yet entertaining game suitable for any type of gathering, providing lots of fun and laughter.",
    "diceBluffButton": "Go to DiceBluff",
    "frameGameHeadline": "FrameGame",
    "frameGameLine1": "FrameGame is a modified version of \"Gartic Phone.\" Instead of drawing or painting, in FrameGame, you can create your image using many different image files. A large library of images is available for this purpose.",
    "frameGameButton": "Go to FrameGame",
    "projectsHeadline": "Other projects",
    "projectsSub": "Here are other projects that are in progress. Most of them are still in the early stages of development and are very unpolished.",
    "projectsAUL": "AmongUsLive",
    "projectsAULText": "AmongUsLive is a version of Among Us that you can play in real life. This browser game aims to simulate the gameplay and excitement of the original game in a real-world setting. Your smartphone serves as your companion throughout the experience. This project is currently on hold due to complications during development and prioritization of other projects.",
    "projectsDC": "DiscordBot",
    "projectsDCText": "DiscordBot is a custom-built Discord bot. This project is still in its early stages and is waiting to be filled with features from the community.",
    "projectsRW": "RaspiWindow",
    "projectsRWText": "RaspiWindow is a smart window that displays various information about different things. The project is a web application that was originally shown on my Raspberry Pi 3b+. Currently, it is designed for private use only. A community-friendly version will follow.",
    "projectsIC": "Intercra",
    "projectsICText": "Intercra is a custom search engine that displays search results based on predefined websites. This project was developed as part of my high school graduation exam.",
    "ideasHeadline": "Ideas for additional projects",
    "ideasSub": "Here are ideas for projects that I would like to implement.",
    "ideasProject1Headline": "Ludo with Power-ups",
    "ideasProject1Text": "Enhance Ludo by incorporating power-ups to expand and make the gameplay more exciting.",
    "ideasProject2Headline": "BattleFlag",
    "ideasProject2Text": "An adaptation of the old ICQ game called 'RPS'. It’s a mix of Rock-Paper-Scissors and chess.",
    "ideasProject3Headline": "OpenBG",
    "ideasProject3Text": "A repository for browser game lobbies. A platform where the private lobbies of browser games are listed so that other players can join them.",
    "ideasProject4Headline": "LEDSteuerung",
    "ideasProject4Text": "A LED control software that allows you to manage LEDs, specifically designed for addressable LEDs such as WS2812 LEDs.",
    "statsStatus": "Server Status",
    "statsDBHeadline": "DiceBluff",
    "statsDBSessionOnline": "Sessions Online",
    "statsDBPlayersOnline": "Playerrs Online",
    "statsDBSessionTotal": "Total Sessions",
    "statsDBWinner": "Total Winners",
    "statsDBLooser": "Total Loosers",
    "statsFGHeadline": "FrameGame",
    "statsFGSessionOnline": "Sessions Online",
    "statsFGPlayersOnline": "Playerrs Online",
    "statsFGSessionTotal": "Total Sessions",
    "statsFGImage": "Created Images"
  },
  "games": {
    "dbHeadline": "DiceBluff",
    "dbLine1": "DiceBluff is a browser game adaptation of the dice game called \"Mäxchen\" or \"Mia.\" The goal is to avoid getting caught lying and to have a bit of luck.",
    "dbLine2": "But how does the game work? Let me explain it briefly. Under a cup, there are 2 dice. These dice produce a number, where the larger number on the dice represents the tens place and the smaller number represents the ones place. For example, a roll of \"2\" and \"5\" gives the number 52, and a roll of \"6\" and \"1\" gives the number 61. If we exclude all the combinations with a pair, we have the following numbers: 31-32, 41-43, 51-54, 61, 65. The next highest number after \"65\" is the one-pair (\"11\"). This is followed by the two-pair (\"22\"), and so on up to the six-pair (\"66\"). The highest number is \"21\".",
    "dbLine3": "After I roll the dice, only I can see the result. Let’s say I roll a 43. I then pass the cup to the next player and claim that I rolled a \"43.\" The next player must decide whether they believe me or not. If they believe me, they roll the dice and get a two-pair. They then pass the cup to the next player and claim they rolled a two-pair. The next player believes them and rolls the dice, getting a 63. At this point, they must lie, as they need to declare a higher number than what was previously claimed. So, they might claim to have rolled a four-pair. The next player doesn’t believe them, reveals the cup, and catches them lying. The player caught lying loses a life. This process continues until one player wins the game.",
    "dbButton": "Go to DiceBluff",
    "dbButtonFullIntro": "Full Introduction",
    "fgHeadline": "FrameGame",
    "fgLine1": "FrameGame is a modified version of the browser game \"Gartic Phone.\" The goal is to create a fun and entertaining chain of images.",
    "fgLine2": "But how does the game work? The game is divided into rounds, with the number of rounds equal to the number of players. In the first round, each player comes up with a funny or entertaining scenario, such as \"An elephant on the moon wearing a hat.\" In the next round, someone receives the sentence from another player and must recreate it. To do this, players can use text fields and images from the internet. FrameGame includes an integrated image search that provides pictures from the web. This allows players to search for a moon, an elephant, and a hat in the image search and incorporate them into their canvas.",
    "fgLine3": "Once everyone is finished, the game moves to the next round, where players must guess what the created images represent. For example, someone might think that an image shows an elephant on a planet wearing a cap and floating around. In the next round, another player must recreate this new description of the image.",
    "fgLine4": "This often leads to misunderstandings and results in an entertaining chain of images.",
    "fgLine5": "This project is still in development and will be released in the near future.",
    "fgButton": "Go to FrameGame",
    "fgButtonFullIntro": "Full Introduction",
    "aulHeadline": "AmongUsLive",
    "aulLine1": "AmongUsLive is a version of Among Us that can be played in real life.",
    "aulLine2": "The game works by placing QR codes in the buildings where AmongUsLive is played. These QR codes can be scanned to display tasks on the player's phone. Each player receives tasks on their phone that they need to complete, which tells them which QR codes to scan. It is also possible to upload a map of the game area so that each player knows where their tasks are located.",
    "aulLine3": "The Impostor can eliminate players by, for example, tapping them. The exact implementation of this mechanism is left up to the group of players, who must agree on how it will work.",
    "aulLine4": "Sabotages are implemented in such a way that the Impostor can start a sabotage via their phone, and players must scan specific QR codes to fix the sabotage.",
    "aulLine5": "Meetings are organized in such a way that when a player calls a meeting, all players receive a notification on their phones that a meeting is taking place and that they must meet at a designated location. Once all players have gathered at the meeting point, the player who called the meeting can start it once they confirm that everyone is present. During meetings, players vote on their phones and then see the results after all players have cast their votes.",
    "aulLine6": "There is also an additional feature that allows a display to be continuously shown on a TV or projector screen. This display can be used to track the progress of completed tasks or to see in real-time where a task is being completed. Additionally, meetings can be organized through this display, allowing the voting results to be shown on the screen.",
    "aulLine7": "This project is still in development and will not be released in the near future."

  },
  "projects": {
    "dcHeadline": "DiscordBot",
    "dcLine1": "On my Discord server, there is a custom-built Discord bot that we have named 'Ivan Rusakov.'",
    "dcLine2": "Through it, you could challenge a player to a game of 'Rock-Paper-Scissors' (currently offline).",
    "dcLine3": "You can also use it to display Unsplash images based on a search term and play heads or tails.",
    "dcLine4": "This project is currently running on a Strato server. There are plans to migrate the project to a VPS, which is one of the reasons it is not yet available to the public.",
    "rwHeadline": "RaspiWindow",
    "rwLine1": "RaspiWindow is a fullscreen website that can continuously display various information. To date, it can show stock prices, weather updates, and the latest Discord messages. RaspiWindow also changes the background every 10 minutes. I have set the background theme to 'Space'.",
    "icHeadline": "Intercra",
    "icLine1": "Intercra is a search engine where you can decide which websites can display search results and which cannot. This project was part of a special assignment for my high school graduation exam in Computer Science.",
    "icLine2": "For a better impression, feel free to visit Intercra.",
    "icButton": "Go to Intercra"
  },
  "nav": {
    "games": "Games",
    "projects": "Projects"
  },
  "ui": {
    "moreInformationButton": "More Information",
    "moreInfosButton": "More Infos"
  }
}